{"classes":["MANUFACTURER","COMPANY","AMOUNT"],"annotations":[["Foxconn is best known as the main assembler of Apple’s iPhones. But in last couple of years, the Taiwanese firm has made a push into semiconductors, betting that the rise of technologies like artificial intelligence will boost demand for these chips.\r",{"entities":[[0,7,"MANUFACTURER"],[47,54,"COMPANY"]]}],["“Established players such as TSMC, Samsung or Micron count with several decades of R&D (research and development), process engineering and trillions of dollars in investment to reach their current capabilities.”\r",{"entities":[[29,33,"MANUFACTURER"],[35,42,"COMPANY"],[46,52,"MANUFACTURER"]]}],["Foxconn, officially known as Hon Hai Technology Group, is a contract electronics manufacturer that assembles consumer products like iPhones. But in the last two years, it has stepped up its presence in semiconductors.\r",{"entities":[[0,7,"MANUFACTURER"],[29,53,"MANUFACTURER"]]}],["In May 2021, it formed a joint venture with Yageo Corporation, which makes various types of electronic components. That same year, Foxconn bought a chip plant from Taiwanese chipmaker Macronix\r",{"entities":[[44,61,"MANUFACTURER"],[131,138,"MANUFACTURER"],[184,192,"MANUFACTURER"]]}],["The biggest ramp-up in effort came last year when Foxconn agreed with Indian metals-to-oil conglomerate Vedanta to set up a semiconductor and display production plant in India as part of a $19.5 billion joint venture.\r",{"entities":[[50,57,"MANUFACTURER"],[104,111,"MANUFACTURER"],[189,202,"AMOUNT"]]}],["Don’t expect Nvidia’s rally to lose steam, Citi says Standard Chartered sees upside to its 2024 bitcoin target of $100,000.The chip wars are heating up. This Chinese stock rose 30% in five days\r",{"entities":[[13,21,"COMPANY"],[43,47,"COMPANY"],[53,71,"COMPANY"],[114,126,"AMOUNT"]]}],["Neil Shah, vice president of research at Counterpoint Research, said Foxconn’s push into semiconductors is about diversifying its business, and the company’s decision to launch an electric car unit is part of that plan. Its aim is to become a “one stop shop” for electronics and automotive companies, Shah said.\r",{"entities":[[69,78,"MANUFACTURER"]]}],["If Foxconn could assemble electronics and manufacture chips, it would be a very unique and competitive business.\r",{"entities":[[3,10,"MANUFACTURER"]]}]]}